; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image2 - mode
	spectrograph4 - mode
	infrared3 - mode
	thermograph0 - mode
	image1 - mode
	Star2 - direction
	GroundStation7 - direction
	GroundStation13 - direction
	Star4 - direction
	Star11 - direction
	Star9 - direction
	GroundStation10 - direction
	Star5 - direction
	Star14 - direction
	Star12 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star8 - direction
	Star1 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument1 image2)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star11)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(have_image Star15 image1)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph4)
))

)

; plan
1. (turn_to satellite3 groundstation6 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation6)
   goals met: 0 of 3
2. (turn_to satellite1 groundstation6 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 3
3. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 3
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
5. (calibrate satellite3 instrument3 groundstation6)
   added: (calibrated instrument3)
   goals met: 0 of 3
6. (calibrate satellite1 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 3
7. (turn_to satellite1 phenomenon16 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon16)
   goals met: 0 of 3
8. (take_image satellite1 phenomenon16 instrument1 image2)
   added: (have_image phenomenon16 image2)
   goals met: 1 of 3
9. (turn_to satellite1 planet17 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet17)
   goals met: 1 of 3
10. (take_image satellite1 planet17 instrument1 spectrograph4)
   added: (have_image planet17 spectrograph4)
   goals met: 2 of 3
11. (turn_to satellite3 star15 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 star15)
   goals met: 2 of 3
12. (take_image satellite3 star15 instrument3 image1)
   added: (have_image star15 image1)
   goals met: 3 of 3
